ksekimoto/micropython/ports/rx/rx65n/rx65n_tpu.c
float rx_tpu_get_duty(uint8_t pin_idx) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return TPU_DEFAULT_DUTY;
    }
    return rx_tpu_channel_duty[channel];
}

void rx_tpu_start(uint8_t pin_idx) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return;
    }
    rx_tpu_channel_enable(channel);
}

void rx_tpu_stop(uint8_t pin_idx) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return;
    }
    rx_tpu_channel_disable(channel);
}

static void rx_tpu_set_pin(uint8_t pin_idx) {
    uint8_t port = GPIO_PORT(pin_idx);
    uint8_t mask = GPIO_MASK(pin_idx);
    MPC.PWPR.BIT.B0WI = 0;  /* Enable write to PFSWE */
    MPC.PWPR.BIT.PFSWE = 1; /* Enable write to PFS */
    _PMR(port) &= ~mask;
    _PDR(port) |= mask;
    _PODR(port) |= mask;
    _PXXPFS(port, pin_idx & 7) = 0x03;
    _PMR(port) |= mask;
    MPC.PWPR.BYTE = 0x80;   /* Disable write to PFSWE and PFS*/
}

static void rx_tpu_reset_pin(uint8_t pin_idx) {
    uint8_t port = GPIO_PORT(pin_idx);
    uint8_t mask = GPIO_MASK(pin_idx);
    MPC.PWPR.BIT.B0WI = 0;  /* Enable write to PFSWE */
    MPC.PWPR.BIT.PFSWE = 1; /* Enable write to PFS */
    _PXXPFS(port, pin_idx & 7) = 0x00;
    _PMR(port) &= ~mask;
    MPC.PWPR.BYTE = 0x80;   /* Disable write to PFSWE and PFS*/
}

void rx_tpu_pin_init(uint8_t pin_idx) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return;
    }
    rx_tpu_set_pin(pin_idx);
    rx_tpu_channel_init(channel);
    rx_tpu_set_channel_params(pin_idx, channel,
        rx_tpu_channel_freq[channel],
        rx_tpu_channel_duty[channel]);
    // rx_tpu_channel_enable(channel);
}

void rx_tpu_pin_deinit(uint8_t pin_idx) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return;
    }
    rx_tpu_reset_pin(pin_idx);
    rx_tpu_channel_disable(channel);
}

static void rx_tpu_channel_init_clear_flag(void) {
    for (int i = 0; i < TPU_CHANNEL_SIZE; i++) {
        rx_tpu_channel_init_flag[i] = false;
    }
}

void rx_tpu_init() {
    SYSTEM.PRCR.WORD = 0xA502;
    #if defined(RX63N)
    SYSTEM.MSTPCRA.BIT.MSTPA12 = 0; // TPU1
    #endif
    SYSTEM.MSTPCRA.BIT.MSTPA13 = 0; // TPU0
    SYSTEM.PRCR.WORD = 0xA500;
    rx_tpu_channel_init_clear_flag();
}

void rx_tpu_deinit() {
    SYSTEM.PRCR.WORD = 0xA502;
    #if defined(RX63N)
    SYSTEM.MSTPCRA.BIT.MSTPA12 = 1; // TPU1
    #endif
    SYSTEM.MSTPCRA.BIT.MSTPA13 = 1; // TPU0
    SYSTEM.PRCR.WORD = 0xA500;
    rx_tpu_channel_init_clear_flag();
}
